[
    {
        "name": "Bean Thread Noodles with Chicken Bamboo Stir Fry",
        "author": "123 Eat @123EatbyCox",
        "id": "1",
        "ctext": "This is simple but very flavorful dish! Especially with the noodles soaking up the gelatnous impact of the chicken wing tips, this is a must-try dish. ",
        "time": "55 minutes",
        "serving": "4 servings",
        "imageURL": "https://i.ibb.co/gJWkH0y/Bean-Thread-Stir-Fry-123-Eat.png",
        "ingredients": [
            {
                "quantity": "1 lbs",
                "name": "chicken",
                "spec": "ground"
            },
            {
                "quantity": "1 tbsp",
                "name": "oil",
                "spec": ""
            },
            {
                "quantity": "10",
                "name": "chicken wing",
                "spec": "tips"
            },
            {
                "quantity": "1 cup",
                "name": "bean thread noodle",
                "spec": "cooked and cut to shorter lengths"
            },
            {
                "quantity": "1/2 cup",
                "name": "bell pepper",
                "spec": "cut into strips"
            },
            {
                "quantity": "1 cup",
                "name": "bamboo shoot",
                "spec": "cut into thin strips"
            },
            {
                "quantity": "4 stalks",
                "name": "green onion",
                "spec": "cut into 1/2 inch thick pieces"
            },
            {
                "quantity": "4 tbsp",
                "name": "Ajinomoto seasoning powder Thai basil stir fry",
                "spec": ""
            },
            {
                "quantity": "2 tbsp",
                "name": "oyster sauce",
                "spec": ""
            },
            {
                "quantity": "60 ml",
                "name": "water",
                "spec": ""
            }
        ],
        "steps": [
            "Mix the 60 ml of water and the Ajinomoto seasoning until the seasoning has best dissolved. Set this to the side.",
            "Add oil to a large pan and set on medium heat.",
            "Cook the ground chicken and the chicken wing tips until golden brown or fully cooked.",
            "Add the bamboo shoots and cook for another 2 minutes.",
            "Add the mixture of water and seasoning, oyster sauce, and bean thread noodles. Cook for another 3 minutes while folding the mixture together.",
            "Add bell peppers and green onions. After mixing well, it is ready to serve!"
        ]
    },
    {
        "name": "Zaub Ntsuab Hau Nrog Nqaij Npuas Boiled Sherlihon with Pork",
        "author": "Lou Vang",
        "id": "12",
        "ctext": "This is a simple, but essential, Hmong dish that is at almost every large Hmong event. From shaman ritual gatherings to weddings, this is a go-to dish that can be made in large batches to feed the whole event. The pork belly can be substituted for any cut of meat. The light broth is also a favorite to eat with rice! Pair this dish with some Hmong pepper and it is game over.",
        "time": "25 minutes",
        "serving": "6 servings",
        "imageURL": "https://i.ibb.co/LvBZNR2/zaub-ntsuab-Lou-V.jpg",
        "ingredients": [
            {
                "quantity": "1 pack",
                "name": "sherlihon",
                "spec": ""
            },
            {
                "quantity": "1 pack",
                "name": "pork belly",
                "spec": ""
            },
            {
                "quantity": "",
                "name": "salt",
                "spec": ""
            }
            ,
            {
                "quantity": "",
                "name": "water",
                "spec": ""
            }
        ],
        "steps": [
            "Rinse the pork belly and lice them into sizes of your preference (the smaller the faster it will cook).",
            "In a medium-sized pot, fill it halfway with water and set it on high on the stove.",
            "Place the meat in the pot to boil until the meat is cooked (usually when the slices are floating:, they are cooked).",
            "While the pot is cooking the meat, snap the leaved of the sherlihon, cut away any bad areas, and rinse them to get the dirt out. You can snap the stems and leaves into more sizable pieces.",
            "Once the meat is cooked, put the washed sherlihon into the pot. Make sure that each piece has been submerged into the boiling broth",
            "Wait about 5 minutes to cook. Test a stem for the level of softness you prefer.",
            "Add salt to taste and stir the pot a few times.",
            "Once the stem is the preferred softness, turn off the heat and it is ready to serve. To store, take out all the sherlihon onto a separate plate so that the hot broth do not overcook them. Wait until the broth has cooled before putting them back in to store."
        ]
    },
    {
        "name": "Khaub Piaj Noodles",
        "author": "123 Eat @123EatbyCox",
        "id": "3",
        "ctext": "Learn how to make your own Khaub Piaj noodles! That way, you can adjust the firmness and size of your noodles. This is a simple recipe provided by 123 Eat by Cox!",
        "time": "30 minutes",
        "serving": "8 servings",
        "imageURL": "https://i.ibb.co/thRthj0/Khao-Piaj-123-Eat.jpg",
        "ingredients": [
            {
                "quantity": "3 bags",
                "name": "tapioca starch",
                "spec": "Green Three Deer Brand"
            },
            {
                "quantity": "1 bag",
                "name": "rice flour",
                "spec": "Red Erawan Brand"
            },
            {
                "quantity": "5 cups",
                "name": "water",
                "spec": "boiling"
            }
        ],
        "steps": [
            "Mix 2 bags of tapioca starch and 1 bag of rice flour thoroughly.",
            "On a clean surface, gather the mixture into a collective pile. Create a well (hole) in the center of the pile where you will pour water in later.",
            "Boil 5 cups of water.",
            "Slowly pour a little of the boiling water into the well.",
            "Fold the powder mixture in with a spatula and create another well to pour boiling water in again.",
            "Repeat steps 4 and 5 until all the water has been poured.",
            "Keep folding with the spatula until the dough is cool enough to touch.",
            "Knead the dough, and use the extra bag of tapioca starch as needed to keep dough from sticking to hands and surface.",
            "The dough is ready to be cut into any preferred noodle size."
        ]
    },
    {
        "name": "Kuv Niam Cov Mov Qhab Ntsev My Mom Tasty Salt Rice",
        "author": "KaLia Yang",
        "id": "4",
        "ctext": "If you are looking for a savory comfort food then do you dare to attempt this dish? This dish will satisfy the craving of salty foods with rice. It is warm and will keep you full! This dish is solely from my dearest Hmong Mother that was born in Laos and came to the US. This recipe has pork belly listed as the meat, but anything with a lot of fat and tendons like pig feet would work too! Sharing this recipe with all of you wonderful people. I believe you will enjoy my Mother different version of sticky white rice.",
        "time": "2 hours",
        "serving": "6 servings",
        "imageURL": "https://i.ibb.co/PCMYgh8/saltyrice-Ka-Lia.jpg",
        "ingredients": [
            {
                "quantity": "1 package",
                "name": "pork belly",
                "spec": "thinly sliced"
            },
            {
                "quantity": "2 cups",
                "name": "sticky rice",
                "spec": ""
            },
            {
                "quantity": "1 clove",
                "name": "ginger",
                "spec": ""
            },
            {
                "quantity": "3 tbsp",
                "name": "lard",
                "spec": ""
            },
            {
                "quantity": "2 pinch",
                "name": "salt",
                "spec": ""
            }
        ],
        "steps": [
            "Rinse the white sticky rice in the bowl in warm to cold water. Rinse and pour water out about 3-4 times. Repeat until the water on the rice is a bit clear then the rice should be good.",
            "You can choose to keep the skin of the ginger. If not, then use a spoon and scrape the outer layer of the ginger.",
            "Grab a pot and bring it to the sink and fill the pot about more than half way. Bring the pot of water to the stove and turn it to high heat.",
            "Place the pork belly into the pot. Let it cook for 25 minutes. After 25 minutes, grab the pot and pour out the hot water in the sink into the strainer and set that aside.",
            "Use the back of the medium or butcher knife and a cutting board, start smashing the ginger until it is almost a paste. Scoop the paste ginger to the small bowl and set it aside.",
            "Fill the pot with water about more than half way of the pot. Set that on the stove and heat up the pot on high.",
            "Put 3 tablespoons of lard into a stir-fry pan. Does not have to be an exact measurement and that is perfectly fine!",
            "Grab the rice steamer with a boiler and separate the top layer from the bottom layer. Go to the sink and fill the bottom layer pot boiler with water more than half way. Leave the top layer of the rice steamer in the sink and keep the cover for the top off.",
            "Go to the stove and heat the stir-fry pan at medium until the lard melts. Throw in the paste ginger into the melted pork oil and grab the cooking stir utensil. Stir the ginger between 3-4 times and spread it evenly on the pan.",
            "Grab the bowl of the rinsed sticky white rice and pour it into the stir-fry pan that is cooking the ginger. Stir the rice until it has heated up enough that the rice has soaked up the oil for about 2 and a half minutes.",
            "Turn off the stove for the stir-fry pan. Pour the stir-fry rice mix into the hot water of the pot (not the bottom boiler steam rice!). Stir the pot and let the rice bring to a hot boil. Add two pinch of salt and stir again.",
            "Turn off the stove for the pot. Grab and wear the safety mitts to both of your hands. Grab the hot boiling pot with the rice mix. Go to the sink and pour the hot water rice mix into the top layer rice steamer. Let the hot water rice mix drain then grab the top layer of rice steamer with the partially cooked rice mix and put that on top the bottom layer of the steam rice boiler. (Watch out for dripping hot liquids on legs and toes!)",
            "Grab the bowl of cooked pork belly. Pour and spread the meat on top of the rice mix in the rice steamer evenly. Cover it with the lid.",
            "Let the rice mix steam for a good 35-40 minutes. Then turn off the stove.",
            "Use your safety hand mitts and pour the cooked rice onto the long aluminum tray. Grab the rice scooper and use that to spread the cooked rice and mix it well with the pork. Make sure to spread the sticky white rice cooked with pork evenly. Let it cool for 5-7 minutes before serving."
        ]
    }
]